In [19]:
######

In [20]:
!pip install ipython-sql==0.4.1 sqlalchemy pymysql prettytable==0.7.2 --quiet

In [21]:
!pip install sqlalchemy==1.4.46

Requirement already satisfied: sqlalchemy==1.4.46 in /opt/anaconda3/lib/python3.12/site-packages (1.4.46)
Requirement already satisfied: greenlet!=0.4.17 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy==1.4.46) (3.0.1)

In [60]:
%load_ext sql
%sql mysql+pymysql://root:coolNeon%4023@localhost:3306/farmers_market

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [61]:
%%sql
show tables;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments

In [62]:
%sql mysql+pymysql://root:coolNeon%4023@localhost:3306/demo

In [63]:
%sql show tables;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

  Tables_in_demo
0     house_mate

In [64]:
house_mate_df=%sql select * from house_mate;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
6 rows affected.

In [65]:
import pandas as pd
pd.DataFrame(house_mate_df)

     name  room no   rent
0   karan        1  200.0
1   Issac        2  300.0
2  Newton       12  100.0
3   Issac       20  150.0
4  Newton      112  100.0
5   Issac      210  150.0

### configure SqlMagic's autopandas option to True so that the result is auto converted in DataFrame

In [66]:
%config SqlMagic.autopandas = True

In [67]:
value= %sql select name from house_mate
type(value)

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
6 rows affected.

pandas.core.frame.DataFrame

In [68]:
%sql select database();

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

  database()
0       demo

In [69]:
%sql show tables;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

  Tables_in_demo
0     house_mate

In [70]:
%sql select * from demo.house_mate;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
6 rows affected.

     name  room no   rent
0   karan        1  200.0
1   Issac        2  300.0
2  Newton       12  100.0
3   Issac       20  150.0
4  Newton      112  100.0
5   Issac      210  150.0

In [71]:
%sql select * from demo.house_mate;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
6 rows affected.

     name  room no   rent
0   karan        1  200.0
1   Issac        2  300.0
2  Newton       12  100.0
3   Issac       20  150.0
4  Newton      112  100.0
5   Issac      210  150.0

In [72]:
%sql show tables;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

  Tables_in_demo
0     house_mate

In [73]:
%sql describe booth

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1146, "Table 'demo.booth' doesn't exist")
[SQL: describe booth]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [74]:
%sql select * from farmers_market.booth;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
12 rows affected.

,booth_number,booth_price_level,booth_description,booth_type
0,1,A,First booth to the left as you enter the cente...,Standard
1,2,A,Second booth to the left as you enter the cent...,Standard
2,3,B,Third booth to the left as you enter the cente...,Small
3,4,C,First booth on left end of building - Small sq...,Small
4,5,C,Second booth on left end of building - Small ...,Small
5,6,C,Third booth on left end of building - Small s...,Small
6,7,A,First booth to the right as you enter the cent...,Standard
7,8,C,First booth on right end of building - Small ...,Small
8,9,C,First booth on right end of building - Small ...,Small
9,10,B,Back right booth - Large rectangular table size,Large
10,11,B,Back center booth - Large rectangular table size,Large
11,12,B,Back left booth - Large rectangular table size,Large

In [75]:
# Let us see the total number of rows in customer table
%sql select count(*) as total_rows from farmers_market.customer;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

   total_rows
0          26

In [76]:
# Let us see the total columns in the table just like we do data_frame.columns

In [77]:
%%sql select column_name from information_schema.columns
where table_schema="farmers_market"
and table_name="customer";

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
4 rows affected.

           COLUMN_NAME
0          customer_id
1  customer_first_name
2   customer_last_name
3         customer_zip

In [78]:
# Let us put slice the table like we do customer_df["customer_name"][:5] in data frame
%sql select customer_first_name  from farmers_market.customer limit 10;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
10 rows affected.

  customer_first_name
0                Jane
1              Manuel
2                 Bob
3              Deanna
4             Abigail
5               Betty
6             Jessica
7               Norma
8               Janet
9             Russell

In [79]:
# Let Us find out how unique values are searched? 
# customer["customer_first_name"].unique() ---> python version
%sql select distinct customer_first_name as unique_name from farmers_market.customer;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
26 rows affected.

   unique_name
0         Jane
1       Manuel
2          Bob
3       Deanna
4      Abigail
5        Betty
6      Jessica
7        Norma
8        Janet
9      Russell
10     Richard
11        Jack
12      Jeremy
13     William
14     Darrell
15         Ada
16      Carlos
17        Jeri
18         Iva
19     Valerie
20       Duane
21      George
22       Alvin
23        Dawn
24      Bonnie
25      Tracie

In [80]:
%sql select count( distinct customer_first_name)  from farmers_market.customer

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

   count( distinct customer_first_name)
0                                    26

In [81]:
%sql select * from farmers_market.customer

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
26 rows affected.

    customer_id customer_first_name customer_last_name customer_zip
0             1                Jane             Connor        22801
1             2              Manuel               Diaz        22821
2             3                 Bob             Wilson        22821
3             4              Deanna         Washington        22801
4             5             Abigail             Harris        22801
5             6               Betty            Bullard        22801
6             7             Jessica            Armenta        22821
7             8               Norma         Valenzuela        22821
8             9               Janet             Forbes        22801
9            10             Russell            Edwards        22801
10           11             Richard            Paulson        22801
11           12                Jack               Wise        22821
12           13              Jeremy             Gruber        22821
13           14             William              Lopes        22801
14           15             Darrell            Messina        22801
15           16                 Ada             Nieves        22801
16           17              Carlos               Diaz        22802
17           18                Jeri           Mitchell        22802
18           19                 Iva           Kienzler        22802
19           20             Valerie             Loftis        22802
20           21               Duane               Sipp        22801
21           22              George                Rai        22801
22           23               Alvin             Laurie        22801
23           24                Dawn               Nale        22801
24           25              Bonnie             Hassan        22801
25           26              Tracie           Goehring        22821

In [82]:
%sql show tables from farmers_market

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments

In [83]:
# The next task is to join all the tables and make one out of it

In [84]:
%sql create table sales_log ( item int primary key, sale_amount decimal(12,2)) into smart_data

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'into smart_data' at line 1")
[SQL: create table sales_log ( item int primary key, sale_amount decimal(12,2)) into smart_data]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [85]:
list1=list(range(2,6))
list2=list(range(3,6))
list1 in list2

False

In [86]:
[3,4,5] in list1

False

In [87]:
3 in list1

True

In [88]:
customer_data=%sql select * from farmers_market.customer
customer_data_frame=pd.DataFrame(customer_data)
customer_data_frame

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
26 rows affected.

    customer_id customer_first_name customer_last_name customer_zip
0             1                Jane             Connor        22801
1             2              Manuel               Diaz        22821
2             3                 Bob             Wilson        22821
3             4              Deanna         Washington        22801
4             5             Abigail             Harris        22801
5             6               Betty            Bullard        22801
6             7             Jessica            Armenta        22821
7             8               Norma         Valenzuela        22821
8             9               Janet             Forbes        22801
9            10             Russell            Edwards        22801
10           11             Richard            Paulson        22801
11           12                Jack               Wise        22821
12           13              Jeremy             Gruber        22821
13           14             William              Lopes        22801
14           15             Darrell            Messina        22801
15           16                 Ada             Nieves        22801
16           17              Carlos               Diaz        22802
17           18                Jeri           Mitchell        22802
18           19                 Iva           Kienzler        22802
19           20             Valerie             Loftis        22802
20           21               Duane               Sipp        22801
21           22              George                Rai        22801
22           23               Alvin             Laurie        22801
23           24                Dawn               Nale        22801
24           25              Bonnie             Hassan        22801
25           26              Tracie           Goehring        22821

In [89]:
last_names=['Diaz' , 'Edwards', 'Wilson']
customer_data_frame['quantity']=range(26,52)
customer_data_frame[['customer_id','customer_last_name','customer_first_name']] [(customer_data_frame["customer_last_name"]=="Diaz") | (customer_data_frame["customer_first_name"]=="William")
]

    customer_id customer_last_name customer_first_name
1             2               Diaz              Manuel
13           14              Lopes             William
16           17               Diaz              Carlos

In [90]:
import numpy as np

np.random.random_sample(26).sum()

9.696663473034224

In [91]:
customer_data_frame

    customer_id customer_first_name customer_last_name customer_zip  quantity
0             1                Jane             Connor        22801        26
1             2              Manuel               Diaz        22821        27
2             3                 Bob             Wilson        22821        28
3             4              Deanna         Washington        22801        29
4             5             Abigail             Harris        22801        30
5             6               Betty            Bullard        22801        31
6             7             Jessica            Armenta        22821        32
7             8               Norma         Valenzuela        22821        33
8             9               Janet             Forbes        22801        34
9            10             Russell            Edwards        22801        35
10           11             Richard            Paulson        22801        36
11           12                Jack               Wise        22821        37
12           13              Jeremy             Gruber        22821        38
13           14             William              Lopes        22801        39
14           15             Darrell            Messina        22801        40
15           16                 Ada             Nieves        22801        41
16           17              Carlos               Diaz        22802        42
17           18                Jeri           Mitchell        22802        43
18           19                 Iva           Kienzler        22802        44
19           20             Valerie             Loftis        22802        45
20           21               Duane               Sipp        22801        46
21           22              George                Rai        22801        47
22           23               Alvin             Laurie        22801        48
23           24                Dawn               Nale        22801        49
24           25              Bonnie             Hassan        22801        50
25           26              Tracie           Goehring        22821        51

In [92]:
%%sql select * from farmers_market.customer
    where 
        customer_first_name in ('Bob','Ada','Jeri')
        or customer_last_name in ('Rai', 'Lopes', 'Daiz')
order by customer_last_name, customer_first_name

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
5 rows affected.

   customer_id customer_first_name customer_last_name customer_zip
0           14             William              Lopes        22801
1           18                Jeri           Mitchell        22802
2           16                 Ada             Nieves        22801
3           22              George                Rai        22801
4            3                 Bob             Wilson        22821

In [93]:
%%sql select * from farmers_market.customer
    where 
        customer_first_name in ('Bob','Ada','Jeri')
        or customer_last_name in ('Rai', 'Lopes', 'Daiz')
order by customer_first_name desc, customer_last_name

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
5 rows affected.

   customer_id customer_first_name customer_last_name customer_zip
0           14             William              Lopes        22801
1           18                Jeri           Mitchell        22802
2           22              George                Rai        22801
3            3                 Bob             Wilson        22821
4           16                 Ada             Nieves        22801

In [94]:
product_data_frame= %sql select * from farmers_market.product
product_data_frame

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
23 rows affected.

,product_id,product_name,product_size,product_category_id,product_qty_type
0,1,Habanero Peppers - Organic,medium,1,lbs
1,2,Jalapeno Peppers - Organic,small,1,lbs
2,3,Poblano Peppers - Organic,large,1,unit
3,4,Banana Peppers - Jar,8 oz,3,unit
4,5,Whole Wheat Bread,1.5 lbs,3,unit
5,6,Cut Zinnias Bouquet,medium,5,unit
6,7,Apple Pie,"10""",3,unit
7,8,Cherry Pie,"10""",3,unit
8,9,Sweet Potatoes,medium,1,lbs
9,10,Eggs,1 dozen,6,unit
10,11,Pork Chops,1 lb,6,lbs
11,12,Baby Salad Lettuce Mix - Bag,1/2 lb,1,unit
12,13,Baby Salad Lettuce Mix,1 lb,1,lbs
13,14,Red Potatoes,None,1,None
14,15,Red Potatoes - Small,,1,None
15,16,Sweet Corn,Ear,1,unit
16,17,Carrots,sold by weight,1,lbs
17,18,Carrots - Organic,bunch,1,unit
18,19,Farmer's Market Resuable Shopping Bag,medium,7,unit
19,20,Homemade Beeswax Candles,"6""""",7,unit
20,21,Organic Cherry Tomatoes,pint,1,unit
21,22,Roma Tomatoes,medium,1,lbs
22,23,Maple Syrup - Jar,8 oz,2,unit

In [95]:
product_data_frame.loc[product_data_frame['product_size'].isna(),:]

,product_id,product_name,product_size,product_category_id,product_qty_type
13,14,Red Potatoes,None,1,None

In [96]:
product_data_frame[product_data_frame.map(lambda x:x==1)]

    product_id product_name product_size  product_category_id product_qty_type
0          1.0          NaN          NaN                  1.0              NaN
1          NaN          NaN          NaN                  1.0              NaN
2          NaN          NaN          NaN                  1.0              NaN
3          NaN          NaN          NaN                  NaN              NaN
4          NaN          NaN          NaN                  NaN              NaN
5          NaN          NaN          NaN                  NaN              NaN
6          NaN          NaN          NaN                  NaN              NaN
7          NaN          NaN          NaN                  NaN              NaN
8          NaN          NaN          NaN                  1.0              NaN
9          NaN          NaN          NaN                  NaN              NaN
10         NaN          NaN          NaN                  NaN              NaN
11         NaN          NaN          NaN                  1.0              NaN
12         NaN          NaN          NaN                  1.0              NaN
13         NaN          NaN          NaN                  1.0              NaN
14         NaN          NaN          NaN                  1.0              NaN
15         NaN          NaN          NaN                  1.0              NaN
16         NaN          NaN          NaN                  1.0              NaN
17         NaN          NaN          NaN                  1.0              NaN
18         NaN          NaN          NaN                  NaN              NaN
19         NaN          NaN          NaN                  NaN              NaN
20         NaN          NaN          NaN                  1.0              NaN
21         NaN          NaN          NaN                  1.0              NaN
22         NaN          NaN          NaN                  NaN              NaN

In [106]:
product_data_frame.loc[product_data_frame[product_data_frame.map(lambda x:x==0)],:]

ValueError: Cannot index with multidimensional key

In [107]:
product_data_frame.isna().sum()

product_id             0
product_name           0
product_size           1
product_category_id    0
product_qty_type       2
dtype: int64

In [108]:
product_data_frame.isna().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14     True
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
dtype: bool

In [99]:
product_data_frame.isna().any(axis=0)

product_id             False
product_name           False
product_size            True
product_category_id    False
product_qty_type        True
dtype: bool

In [100]:
product_data_frame["product_size"].isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
Name: product_size, dtype: bool

In [101]:
product_data_frame.loc[ product_data_frame["product_size"].isna(),:]

,product_id,product_name,product_size,product_category_id,product_qty_type
13,14,Red Potatoes,None,1,None

In [102]:
product_data_frame.loc[ product_data_frame["product_qty_type"].isna(),:]

,product_id,product_name,product_size,product_category_id,product_qty_type
13,14,Red Potatoes,None,1,None
14,15,Red Potatoes - Small,,1,None

## IMP CONCEPT
#### In Pandas, to filter rows based on missing values (`NaN`), you use `.isna()` (or `.isnull()`) to get a DataFrame of boolean values, and then apply `.any(axis=1)` to perform a row-wise logical OR—returning `True` for rows with at least one missing value. This results in a 1D boolean Series, which is exactly what's needed for row filtering. You can then use `.loc[]` like `df.loc[df.isna().any(axis=1), :]` to select those rows, or add a second argument to select specific columns. Similarly, `.all(axis=1)` gives `True` only if all values in the row are missing. This approach ensures readable, accurate filtering when dealing with incomplete data.

In [103]:
product_data_frame.loc[product_data_frame.isna().any(axis=1)]

,product_id,product_name,product_size,product_category_id,product_qty_type
13,14,Red Potatoes,None,1,None
14,15,Red Potatoes - Small,,1,None

In [104]:
# any will make multi Dimensional boolean values of column into one single list in any direction
# either rows axis=1 or column axis=0 as below using logical OR operation
product_data_frame.isna().any()

product_id             False
product_name           False
product_size            True
product_category_id    False
product_qty_type        True
dtype: bool

In [105]:
product_data_frame.isna().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14     True
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
dtype: bool

In [ ]:
%sql show tables from farmers_market

In [ ]:
%%sql select * from farmers_market.customer
where customer_first_name ='Jane'

In [ ]:
# in sql blank space is not null so use TRIM to remove blank space to make null. use together like 
'''
product_size IS NULL
             OR TRIM(product_size) = ''
'''

In [ ]:
# Just like we did in pandas how we locate all the null value columns in sql?

In [ ]:
query='''   select product_id, product_name 
             from farmers_market.product
             '''
product= %sql $query
product

In [ ]:
query='''   select product_id, product_name 
             from farmers_market.product
             order by product_name
             limit 5
             '''
%sql $query

In [ ]:
query='''   select product_id, product_name 
             from farmers_market.product
             order by product_id desc
             limit 5
             '''
%sql $query

In [ ]:
query2='''
SELECT market_date, vendor_id, booth_number
  FROM farmers_market.vendor_booth_assignments
  ORDER BY market_date, vendor_id
  LIMIT 5
'''
%sql $query2

In [ ]:
query2='''
SELECT market_date, vendor_id, booth_number
  FROM farmers_market.vendor_booth_assignments
  ORDER BY  vendor_id
  LIMIT 5
'''
%sql $query2

In [ ]:
quer3='''
SELECT
       market_date,
       customer_id,
       vendor_id,
       quantity,
       cost_to_customer_per_qty
  FROM farmers_market.customer_purchases
  
'''

In [ ]:
%sql $quer3

In [ ]:
query4='''
SELECT
       market_date,
       customer_id,
       vendor_id,
       
       sum(quantity* cost_to_customer_per_qty) as total_customer_expense
  FROM farmers_market.customer_purchases
  group by market_date,customer_id, vendor_id
'''
%sql $query4

In [ ]:
%sql select customer_id ,round(customer_id*vendor_id) as new from farmers_market.customer_purchases

In [ ]:
%sql select round(351,-3)

In [ ]:
query5='''
SELECT
       customer_id,
       UPPER(CONCAT(customer_last_name, ", ", customer_first_name)) AS
  customer_name
  FROM farmers_market.customer
  ORDER BY customer_last_name, customer_first_name
  LIMIT 5
'''
%sql $query5

In [ ]:
query6='''
%sql select * from farmers_market.puchases
    where is not null
    '''
%sql $query6

In [117]:
query7=''' select 
group_concat(concat(column_name,' IS NOT NULL') separator ' OR ')
    from information_schema.columns
    where table_name='customer_purchases'
    and table_schema='farmers_market'
         
'''

null_columns=%sql $query7
print(null_columns)
query8=f'''
select * from farmers_market.customer_purchases
where {null_columns} 
'''
%sql $query8

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.
  group_concat(concat(column_name,' IS NOT NULL') separator ' OR ' )
0  product_id IS NOT NULL OR vendor_id IS NOT NUL...
   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '0 product_id IS NOT NULL OR vendor_id IS NOT NUL...' at line 1")
[SQL: select * from farmers_market.customer_purchases where group_concat(concat(column_name,' IS NOT NULL') separator ' OR ' ) 0 product_id IS NOT NULL OR vendor_id IS NOT NUL...]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
query8=f'''
select * from farmers_market.customer_purchases
where {condition }
'''
customer_purchase_data_frame=%sql $query8
customer_purchase_data_frame

In [ ]:
condition=null_columns["group_concat(concat(column_name,' IS NOT NULL') separator ' OR ' )"][0]
condition

In [ ]:
type(null_columns)

In [ ]:
condition

In [ ]:
query9=''' select 
group_concat(concat(column_name,' IS  NULL') separator ' OR ') as concat_value
    from information_schema.columns
    where table_name='product'
    and table_schema='farmers_market'
         
'''
null_columns=%sql $query9

condition2=null_columns["concat_value"][0]
condition2

In [ ]:
query10=f'''
select * from farmers_market.product
where { condition2}
'''
%sql $query10

In [ ]:
market_date_info=%sql select * from farmers_market.market_date_info

In [ ]:
market_date_info

In [ ]:
market_date_info.loc[(market_date_info['market_day']=='Saturday') &(market_date_info['market_year']=='2019') ,:]

In [ ]:
market_date_info

In [ ]:
'''
SELECT market_date, market_rain_flag
  FROM farmers_market.market_date_info
  WHERE market_rain_flag = 1


# pandas version
market_data_info.loc['market_date']
'''

In [ ]:
market_date_info[["market_date","market_rain_flag"]]  [market_date_info['market_rain_flag']==1]

In [ ]:
market_date_info.loc[  market_date_info["market_rain_flag"]==1,["market_date","market_rain_flag"]]

In [ ]:
market_date_info["market_rain_flag"]==1

In [ ]:
query11='''
  SELECT
      market_date,
      customer_id,
      vendor_id,
      quantity * cost_to_customer_per_qty price
  FROM farmers_market.customer_purchases
  WHERE
      market_date IN
          (
          SELECT market_date
          FROM farmers_market.market_date_info
          WHERE market_rain_flag = 1
          )
LIMIT 5


'''

''' Pandas equivalent
# Equivalent to SQL: WHERE column IN (SELECT ...)
rainy_dates = market_date_info.loc[market_date_info["market_rain_flag"] == 1, "market_date"]

filtered = customer_purchases.loc[customer_purchases["market_date"].isin(rainy_dates), :]

'''
%sql $query11

In [ ]:

%sql $query11

In [ ]:
rainy_dates = market_date_info.loc[market_date_info["market_rain_flag"] == 1, "market_date"]

customer_purchase_data_frame["market_date"].isin(rainy_dates)

In [ ]:
LIKE 'Jer%

In [ ]:
query12='''
SELECT
      vendor_id,
      vendor_name,
      vendor_type,
      CASE
          WHEN LOWER(vendor_type) LIKE '%fresh%'
            THEN 'Fresh Produce'
          ELSE 'Other'
      END AS vendor_type_condensed
  FROM farmers_market.vendor
'''
%sql $query12

In [ ]:
query13='''
SELECT
      vendor_id,
      vendor_name,
      vendor_type,
      CASE
          WHEN LOWER(vendor_type) LIKE 'fre%'
            THEN 'Fresh Produce'
          ELSE 'Other'
      END AS vendor_type_condensed
  FROM farmers_market.vendor
'''
%sql $query13

In [ ]:
%sql select * from farmers_market.vendor

In [ ]:
query14='''
SELECT
      vendor_id,
      vendor_name,
      vendor_type,
      CASE
          WHEN LOWER(vendor_type) LIKE 'fre%'
            THEN 'Fresh Produce'
          ELSE 'Other'
      END AS vendor_type_condensed
  FROM farmers_market.vendor
'''
%sql $query14

In [ ]:
query15='''
select vendor_name,vendor_type,
case
    when lower(vendor_type) like 'prepa%'
        then vendor_name ||'3 star'
    else vendor_name ||'5 star'
end as food_category

from farmers_market.vendor
'''
%sql $query15

In [ ]:
%sql describe farmers_market.vendor

## Note
#### In MySQL, use `CONCAT()` instead of `||` for string concatenation, and use `CAST(... AS CHAR)` instead of `CAST(... AS TEXT)`, since `||` and `TEXT` casting are not supported.

In [ ]:
query15='''
select vendor_name,vendor_type,
case
    when lower(vendor_type) like 'prepa%'
        then concat(cast(vendor_name as char), '3 star')
    else concat(cast(vendor_name as char), '5 star')
end as food_category

from farmers_market.vendor
'''
%sql $query15

In [ ]:
query16=''' select vendor_id, vendor_name, vendor_type, 
                   case when vendor_type='Eggs & Meats'
                        then 1
                        else 0
                    end as vendor_type_eggs_meats,

                    case when vendor_type='Fresh Variety: Veggies & More'
                     then 1
                     else 0
                    end as vendor_type_fresh_variety,
                    
                    case when vendor_type='Fresh Focused'
                     then 1
                        else 0
                    end as vendor_type_fresh_focused,
                    
                    case when vendor_type='Arts & Jewelry'
                     then 1
                        else 0
                    end as vendor_type_arts_jewelry,
                    
                    case when vendor_type='Prepared Foods'
                     then 1
                        else 0
                    end as vendor_type_prepared_foods

                    from farmers_market.vendor
            '''
%sql $query16

In [ ]:
%sql select distinct(vendor_type) as vendors from farmers_market.vendor

### SQL JOINS

In [ ]:
%load_ext sql
%sql mysql+pymysql://root:coolNeon%4023@localhost:3306/farmers_market

In [ ]:
%sql select * from farmers_market.product

In [ ]:
%sql select * from farmers_market.product_category

In [ ]:
query17='''
            select * from farmers_market.product
                 right  join farmers_market.product_category on
                        farmers_market.product.product_category_id= farmers_market.product_category.product_category_id
        '''
%sql $query17

In [ ]:
query18='''
            select * from farmers_market.product
                full outer join farmers_market.product_category on
                        farmers_market.product.product_category_id= farmers_market.product_category.product_category_id
        '''
%sql $query18

In [109]:
%load_ext sql
%sql mysql+pymysql://root:coolNeon%4023@localhost:3306/farmers_market

The sql extension is already loaded. To reload it, use:The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.

  %reload_ext sql

Exception during reset or similar
Traceback (most recent call last):
  File "/opt/anaconda3/lib/python3.12/site-packages/pymysql/connections.py", line 806, in _write_bytes
    self._sock.sendall(data)
BrokenPipeError: [Errno 32] Broken pipe

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/opt/anaconda3/lib/python3.12/site-packages/sqlalchemy/pool/base.py", line 763, in _finalize_fairy
    fairy._reset(pool, transaction_was_reset)
  File "/opt/anaconda3/lib/python3.12/site-packages/sqlalchemy/pool/base.py", line 1038, in _reset
    pool._dialect.do_rollback(self)
  File "/opt/anaconda3/lib/python3.12/site-packages/sqlalchemy/engine/default.py", line 683, in do_rollback
    dbapi_connection.rollback()
  File "/opt/anaconda3/lib/python3.12/site-packages/pymysql/connections.py", line 492, in rollback
    self._execute_command(COMMAND.COM_QUERY, "ROLLBACK")
  File "/opt/anaconda3/lib/python3.12/site-packages/pymysql/connections.py", line 864, in _execute_command
    self._write_bytes(packet)
  File "/opt/anaconda3/lib/python3.12/site-packages/pymysql/connections.py", line 809, in _write_bytes
    raise err.OperationalError(
pymysql.err.OperationalError: (2006, "MySQL server has gone away (BrokenPipeError(32, 'Broken pipe'))")

In [ ]:
query18='''
            select * from farmers_market.product
                 right  join farmers_market.product_category on
                        farmers_market.product.product_category_id= farmers_market.product_category.product_category_id
        '''
%sql $query18

In [ ]:
query18 = '''
SELECT *
FROM farmers_market.product AS p
FULL OUTER JOIN farmers_market.product_category AS pc
ON p.product_category_id = pc.product_category_id
'''
%sql $query18

In [113]:
%sql select * from farmers_market.vendor_booth_assignments

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
921 rows affected.

     vendor_id  booth_number market_date
0            1             2  2019-04-03
1            3             1  2019-04-03
2            4             7  2019-04-03
3            7            11  2019-04-03
4            8             6  2019-04-03
..         ...           ...         ...
916          1             2  2020-10-10
917          3             1  2020-10-10
918          7            11  2020-10-10
919          8             7  2020-10-10
920          9             8  2020-10-10

[921 rows x 3 columns]

In [112]:
%sql show tables

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments

In [114]:
%sql describe farmers_market.vendor_booth_assignments

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
3 rows affected.

          Field  Type Null  Key Default Extra
0     vendor_id   int   NO  PRI    None
1  booth_number   int   NO  PRI    None
2   market_date  date   NO  PRI    None

In [115]:
%sql describe farmers_market.customer_purchases

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
7 rows affected.

                      Field           Type Null  Key Default Extra
0                product_id            int   NO  PRI    None
1                 vendor_id            int   NO  PRI    None
2               market_date           date   NO  PRI    None
3               customer_id            int   NO  PRI    None
4                  quantity  decimal(16,2)  YES         None
5  cost_to_customer_per_qty  decimal(16,2)  YES         None
6          transaction_time           time   NO  PRI    None

In [118]:
# Question:
# How do we know which key is the primary key for which table?
# Do we have to manually check all the table if so in what ways?

In [120]:
query19='''
            SELECT
      b.booth_number,
      b.booth_type,
      vba.market_date,
      v.vendor_id,
      v.vendor_name,
      v.vendor_type
  FROM booth AS b
      LEFT JOIN vendor_booth_assignments AS vba ON b.booth_number = vba.
  booth_number
      LEFT JOIN vendor AS v ON v.vendor_id = vba.vendor_id
  ORDER BY b.booth_number, vba.market_date
'''
%sql $query19

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
926 rows affected.

,booth_number,booth_type,market_date,vendor_id,vendor_name,vendor_type
0,1,Standard,2019-04-03,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
1,1,Standard,2019-04-06,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
2,1,Standard,2019-04-10,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
3,1,Standard,2019-04-13,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
4,1,Standard,2019-04-17,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
...,...,...,...,...,...,...
921,11,Large,2020-09-30,7.0,Marco's Peppers,Fresh Focused
922,11,Large,2020-10-03,7.0,Marco's Peppers,Fresh Focused
923,11,Large,2020-10-07,7.0,Marco's Peppers,Fresh Focused
924,11,Large,2020-10-10,7.0,Marco's Peppers,Fresh Focused
925,12,Large,None,NaN,None,None

In [124]:
query19='''
            SELECT
      b.booth_number,
      b.booth_type,
      vba.market_date,
      v.vendor_id,
      v.vendor_name,
      v.vendor_type
  FROM booth AS b
      LEFT JOIN vendor_booth_assignments AS vba ON b.booth_number = vba.
  booth_number
      LEFT JOIN vendor AS v ON v.vendor_id = vba.vendor_id
  ORDER BY b.booth_number
'''
%sql $query19

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
926 rows affected.

,booth_number,booth_type,market_date,vendor_id,vendor_name,vendor_type
0,1,Standard,2019-04-03,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
1,1,Standard,2019-04-06,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
2,1,Standard,2019-04-10,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
3,1,Standard,2019-04-13,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
4,1,Standard,2019-04-17,3.0,Mountain View Vegetables,Fresh Variety: Veggies & More
...,...,...,...,...,...,...
921,11,Large,2020-09-30,7.0,Marco's Peppers,Fresh Focused
922,11,Large,2020-10-03,7.0,Marco's Peppers,Fresh Focused
923,11,Large,2020-10-07,7.0,Marco's Peppers,Fresh Focused
924,11,Large,2020-10-10,7.0,Marco's Peppers,Fresh Focused
925,12,Large,None,NaN,None,None

In [149]:
query20='''
 select table_name, constraint_name, constraint_type
 from information_schema.table_constraints
 where table_name= 'vendor_booth_assignments'
 and table_schema= 'farmers_market'
 '''
%sql $query20

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4 rows affected.

                 TABLE_NAME  CONSTRAINT_NAME CONSTRAINT_TYPE
0  vendor_booth_assignments          PRIMARY     PRIMARY KEY
1  vendor_booth_assignments  booth_number_fk     FOREIGN KEY
2  vendor_booth_assignments   market_date_fk     FOREIGN KEY
3  vendor_booth_assignments     vendor_id_fk     FOREIGN KEY

In [147]:
query21='''
SELECT
    tc.table_name AS junction_table,
    kcu.column_name AS junction_column,
    ccu.table_name AS referenced_table,
    ccu.column_name AS referenced_column
FROM 
    information_schema.table_constraints AS tc
JOIN 
    information_schema.key_column_usage AS kcu
    ON tc.constraint_name = kcu.constraint_name
    AND tc.constraint_schema = kcu.constraint_schema
JOIN 
    information_schema.constraint_column_usage AS ccu
    ON ccu.constraint_name = tc.constraint_name
    AND ccu.constraint_schema = tc.constraint_schema
WHERE 
    tc.constraint_type = 'FOREIGN KEY'
    AND tc.table_name = 'enrollments';
'''

In [153]:
query20='''
 select table_name, constraint_name,column_name,referenced_table_name, referenced_column_name
 from information_schema.key_column_usage
 where table_name= 'vendor_booth_assignments'
 and table_schema= 'farmers_market'
 and referenced_table_name is not null
 '''
%sql $query20

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
3 rows affected.

,TABLE_NAME,CONSTRAINT_NAME,COLUMN_NAME,REFERENCED_TABLE_NAME,REFERENCED_COLUMN_NAME
0,vendor_booth_assignments,booth_number_fk,booth_number,booth,booth_number
1,vendor_booth_assignments,market_date_fk,market_date,market_date_info,market_date
2,vendor_booth_assignments,vendor_id_fk,vendor_id,vendor,vendor_id

In [154]:
%sql select * from farmers_market.vendor

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
9 rows affected.

,vendor_id,vendor_name,vendor_type,vendor_owner_first_name,vendor_owner_last_name
0,1,Chris's Sustainable Eggs & Meats,Eggs & Meats,Chris,Sylvan
1,2,Hernández Salsa & Veggies,Fresh Variety: Veggies & More,Maria,Hernández
2,3,Mountain View Vegetables,Fresh Variety: Veggies & More,Joseph,Yoder
3,4,Fields of Corn,Fresh Focused,Samuel,Smith
4,5,Seashell Clay Shop,Arts & Jewelry,Karen,Soula
5,6,Mother's Garlic & Greens,Fresh Variety: Veggies & More,Vera,Gordon
6,7,Marco's Peppers,Fresh Focused,Marco,Bokashi
7,8,Annie's Pies,Prepared Foods,Annie,Aquinas
8,9,Mediterranean Bakery,Prepared Foods,Kani,Hardi

In [231]:
query22='''

SELECT
      market_date,
      
      cost_to_customer_per_qty,
sum(quantity) as total_quantitiy,
count(*) as item_purchased
  FROM farmers_market.customer_purchases
  group by market_date,cost_to_customer_per_qty
  having count(*)>5
  order by market_date
  
  
'''

In [232]:
%sql $query22

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
389 rows affected.

    market_date cost_to_customer_per_qty total_quantitiy  item_purchased
0    2019-04-03                     4.00           19.00               7
1    2019-04-03                    18.00           20.00              11
2    2019-04-06                     4.00           28.00               8
3    2019-04-06                     6.50           23.00              10
4    2019-04-06                    18.00           16.00               7
..          ...                      ...             ...             ...
384  2020-10-07                     6.50           19.00               7
385  2020-10-07                    18.00           21.00               9
386  2020-10-10                     3.50           30.00               8
387  2020-10-10                     6.50           20.00               7
388  2020-10-10                    18.00           20.00              10

[389 rows x 4 columns]

In [225]:
query22='''

SELECT
    count( quantity)
      
  FROM farmers_market.customer_purchases
   
  
  
'''
%sql $query22

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

   count( quantity)
0              4221

In [241]:
%sql select * from farmers_market.vendor_inventory

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1146, "Table 'farmers_market.vendor_inventory' doesn't exist")
[SQL: select * from farmers_market.vendor_inventory]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [240]:
query23='''
select
vendor_id, market_date, sum(cost_to_customer_per_qty) as total_qty
from farmers_market.customer_purchases
rank_number() over (partition cost_to_customer_per_qty )
order by market_date
'''
%sql $query23

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '() over (partition cost_to_customer_per_qty ) order by market_date' at line 1")
[SQL: select vendor_id, market_date, sum(cost_to_customer_per_qty) as total_qty from farmers_market.customer_purchases rank_number() over (partition cost_to_customer_per_qty ) order by market_date]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [247]:
%sql select * from farmers_market.customer_purchases limit 10

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
10 rows affected.

,product_id,vendor_id,market_date,customer_id,quantity,cost_to_customer_per_qty,transaction_time
0,1,7,2019-07-03,14,0.99,6.99,0 days 17:32:00
1,1,7,2019-07-03,14,2.18,6.99,0 days 18:23:00
2,1,7,2019-07-03,15,1.53,6.99,0 days 18:41:00
3,1,7,2019-07-03,16,2.02,6.99,0 days 18:18:00
4,1,7,2019-07-03,22,0.66,6.99,0 days 17:34:00
5,1,7,2019-07-06,4,0.27,6.99,0 days 12:20:00
6,1,7,2019-07-06,12,3.60,6.99,0 days 09:33:00
7,1,7,2019-07-06,14,3.04,6.99,0 days 13:05:00
8,1,7,2019-07-06,23,1.49,6.99,0 days 12:26:00
9,1,7,2019-07-06,23,2.56,6.99,0 days 12:46:00

In [270]:
query24='''
select *,

row_number() over ( partition by customer_id order by quantity desc) as 'rank'

from farmers_market.customer_purchases order by market_date
limit 10
'''
%sql $query24

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
10 rows affected.

,product_id,vendor_id,market_date,customer_id,quantity,cost_to_customer_per_qty,transaction_time,rank
0,4,7,2019-04-03,3,1.00,4.00,0 days 18:44:00,170
1,4,7,2019-04-03,4,1.00,4.00,0 days 18:09:00,211
2,4,7,2019-04-03,5,3.00,4.00,0 days 18:54:00,82
3,8,8,2019-04-03,5,1.00,18.00,0 days 18:41:00,232
4,4,7,2019-04-03,6,4.00,4.00,0 days 18:49:00,39
5,5,8,2019-04-03,6,1.00,6.50,0 days 17:22:00,167
6,4,7,2019-04-03,7,5.00,4.00,0 days 17:59:00,6
7,7,8,2019-04-03,9,2.00,18.00,0 days 17:08:00,110
8,8,8,2019-04-03,9,2.00,18.00,0 days 16:17:00,119
9,5,8,2019-04-03,9,1.00,6.50,0 days 16:40:00,145

In [268]:
query24='''
select *,

row_number() over ( partition by customer_id order by customer_id desc) as 'rank'

from farmers_market.customer_purchases
limit 10
'''
%sql $query24

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
10 rows affected.

,product_id,vendor_id,market_date,customer_id,quantity,cost_to_customer_per_qty,transaction_time,rank
0,16,4,2020-09-23,1,4.00,0.50,0 days 17:19:00,1
1,16,4,2020-08-29,1,12.00,0.50,0 days 13:57:00,2
2,16,4,2020-09-02,1,6.00,0.50,0 days 18:57:00,3
3,1,7,2019-07-20,1,2.09,6.99,0 days 12:48:00,4
4,1,7,2019-07-20,1,4.93,6.99,0 days 13:00:00,5
5,1,7,2020-07-11,1,4.04,6.99,0 days 13:03:00,6
6,1,7,2020-07-22,1,2.12,6.99,0 days 18:45:00,7
7,1,7,2020-08-26,1,2.97,6.99,0 days 18:56:00,8
8,1,7,2020-09-05,1,5.20,6.99,0 days 11:34:00,9
9,1,7,2020-09-05,1,0.27,6.99,0 days 11:41:00,10

In [277]:
query24='''
select vendor_id,market_date, product_id,
(quantity* cost_to_customer_per_qty) as original_price,
row_number() over ( partition by vendor_id order by quantity desc) as 'rank'

from farmers_market.customer_purchases order by vendor_id,original_price desc

'''
%sql $query24

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

      vendor_id market_date  product_id original_price  rank
0             4  2019-06-08          16         8.0000     1
1             4  2019-06-15          16         8.0000     2
2             4  2019-06-15          16         8.0000     3
3             4  2019-06-26          16         8.0000     4
4             4  2019-06-26          16         8.0000     5
...         ...         ...         ...            ...   ...
4216          8  2020-10-03           5         6.5000  1368
4217          8  2020-10-07           5         6.5000  1369
4218          8  2020-10-10           5         6.5000  1370
4219          8  2020-10-10           5         6.5000  1371
4220          8  2020-10-10           5         6.5000  1372

[4221 rows x 5 columns]

In [285]:
query24='''
select * from 
(
select vendor_id,market_date, product_id,
(quantity* cost_to_customer_per_qty) as original_price,
row_number() over ( partition by vendor_id order by quantity desc) as 'rank'

from farmers_market.customer_purchases order by vendor_id,original_price desc
)  as x
where x.rank=1

'''
%sql $query24

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
3 rows affected.

   vendor_id market_date  product_id original_price  rank
0          4  2019-06-08          16         8.0000     1
1          7  2020-08-22           2        28.0945     1
2          8  2019-04-10           5        52.0000     1

In [288]:
query25='''
select * from 
(
select vendor_id,market_date, product_id,
(quantity* cost_to_customer_per_qty) as original_price,
rank() over ( partition by vendor_id order by quantity desc) as 'rank'

from farmers_market.customer_purchases order by vendor_id,original_price desc
)  as x
where x.rank=1

'''
%sql $query25

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
25 rows affected.

    vendor_id market_date  product_id original_price  rank
0           4  2019-06-08          16         8.0000     1
1           4  2019-06-15          16         8.0000     1
2           4  2019-06-15          16         8.0000     1
3           4  2019-06-26          16         8.0000     1
4           4  2019-06-26          16         8.0000     1
5           4  2019-07-27          16         8.0000     1
6           4  2019-08-14          16         8.0000     1
7           4  2019-09-25          16         8.0000     1
8           4  2020-06-06          16         8.0000     1
9           4  2020-06-13          16         8.0000     1
10          4  2020-06-20          16         8.0000     1
11          4  2020-06-24          16         8.0000     1
12          4  2020-06-24          16         8.0000     1
13          4  2020-07-15          16         8.0000     1
14          4  2020-07-15          16         8.0000     1
15          4  2020-07-29          16         8.0000     1
16          4  2020-08-08          16         8.0000     1
17          4  2020-08-15          16         8.0000     1
18          4  2020-08-19          16         8.0000     1
19          4  2020-08-19          16         8.0000     1
20          4  2020-09-09          16         8.0000     1
21          4  2020-09-23          16         8.0000     1
22          7  2020-08-22           2        28.0945     1
23          8  2019-12-18           8       144.0000     1
24          8  2019-04-10           5        52.0000     1

## Note
### Windiows function can also be used without partitioning the data but
### We need some reference/mechanism by which we can rank or assign row number
### That one is "ORDER BY" as shown in example below

In [294]:
query24='''
select vendor_id,market_date, product_id,
(quantity* cost_to_customer_per_qty) as original_price,
row_number()  over (  order by quantity desc ) as 'rank'

from farmers_market.customer_purchases order by vendor_id,original_price desc

'''
%sql $query24

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

      vendor_id market_date  product_id original_price  rank
0             4  2019-06-08          16         8.0000     1
1             4  2019-06-15          16         8.0000     2
2             4  2019-06-15          16         8.0000     3
3             4  2019-06-26          16         8.0000     4
4             4  2019-06-26          16         8.0000     5
...         ...         ...         ...            ...   ...
4216          8  2020-10-03           5         6.5000  3556
4217          8  2020-10-07           5         6.5000  3557
4218          8  2020-10-10           5         6.5000  3558
4219          8  2020-10-10           5         6.5000  3559
4220          8  2020-10-10           5         6.5000  3560

[4221 rows x 5 columns]

## Ntile(n)
#### ROW_NUMBER() or RANK()
→ Good when you want a fixed number of top items — e.g., “Top 10 most expensive products.”
→ You can filter WHERE row_number <= 10 and you’re done.

But… if you want a percentage or fraction of the results — e.g., “Top 10% of items by price” —
→ The number of items changes when the table grows or shrinks, so your query would need to change too if you use ROW_NUMBER manually.

NTILE(n) solves this
→ It splits your ordered results into n equal groups automatically.
→ Example: NTILE(10) means “Divide the results into 10 buckets.”
→ Bucket 1 = top 10%, Bucket 2 = next 10%, and so on.
→ You just filter WHERE ntile_value = 1 to get the top tenth — no manual counting, works even if the table size changes

In [305]:
query24='''
select vendor_id,market_date, product_id,
(quantity* cost_to_customer_per_qty) as original_price,
ntile(5)  over (  order by quantity desc ) as 'rank'

from farmers_market.customer_purchases 

order by vendor_id,original_price desc

'''
%sql $query24

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

      vendor_id market_date  product_id original_price  rank
0             4  2019-06-08          16         8.0000     1
1             4  2019-06-15          16         8.0000     1
2             4  2019-06-15          16         8.0000     1
3             4  2019-06-26          16         8.0000     1
4             4  2019-06-26          16         8.0000     1
...         ...         ...         ...            ...   ...
4216          8  2020-10-03           5         6.5000     5
4217          8  2020-10-07           5         6.5000     5
4218          8  2020-10-10           5         6.5000     5
4219          8  2020-10-10           5         6.5000     5
4220          8  2020-10-10           5         6.5000     5

[4221 rows x 5 columns]

In [306]:
# Note the rank will go upto the 'n' in ntile(n) e.g data=100 and n=5, then per group have 20
# all 20 will be ranked from 1 to 5 since n=5

In [310]:
query26='''
SELECT *      
      
  FROM farmers_market.customer_purchases
'''
%sql $query26

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

,product_id,vendor_id,market_date,customer_id,quantity,cost_to_customer_per_qty,transaction_time
0,1,7,2019-07-03,14,0.99,6.99,0 days 17:32:00
1,1,7,2019-07-03,14,2.18,6.99,0 days 18:23:00
2,1,7,2019-07-03,15,1.53,6.99,0 days 18:41:00
3,1,7,2019-07-03,16,2.02,6.99,0 days 18:18:00
4,1,7,2019-07-03,22,0.66,6.99,0 days 17:34:00
...,...,...,...,...,...,...,...
4216,16,4,2020-09-30,4,2.00,0.50,0 days 18:48:00
4217,16,4,2020-09-30,11,1.00,0.50,0 days 16:30:00
4218,16,4,2020-09-30,16,5.00,0.50,0 days 18:25:00
4219,16,4,2020-09-30,18,6.00,0.50,0 days 18:28:00
4220,16,4,2020-09-30,18,4.00,0.50,0 days 18:50:00

In [312]:
query26='''
SELECT *      
      
  FROM farmers_market.customer_purchases
  order by market_date, transaction_time, customer_id,product_id
'''
%sql $query26

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

,product_id,vendor_id,market_date,customer_id,quantity,cost_to_customer_per_qty,transaction_time
0,8,8,2019-04-03,9,2.00,18.00,0 days 16:17:00
1,7,8,2019-04-03,9,1.00,18.00,0 days 16:20:00
2,5,8,2019-04-03,9,1.00,6.50,0 days 16:40:00
3,7,8,2019-04-03,9,2.00,18.00,0 days 17:08:00
4,5,8,2019-04-03,6,1.00,6.50,0 days 17:22:00
...,...,...,...,...,...,...,...
4216,5,8,2020-10-10,10,3.00,6.50,0 days 13:41:00
4217,8,8,2020-10-10,7,1.00,18.00,0 days 13:44:00
4218,5,8,2020-10-10,2,1.00,6.50,0 days 13:50:00
4219,4,7,2020-10-10,5,4.00,3.50,0 days 13:50:00
4220,4,7,2020-10-10,11,5.00,3.50,0 days 13:50:00

In [314]:
query27='''
SELECT customer_id,
      market_date,
      vendor_id,
      product_id,
      quantity,cost_to_customer_per_qty,
      quantity * cost_to_customer_per_qty AS price,
      SUM(quantity * cost_to_customer_per_qty) OVER (ORDER BY market_date,
  transaction_time, customer_id, product_id) AS running_total_purchases
  FROM farmers_market.customer_purchases
  '''
%sql $query27

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

,customer_id,market_date,vendor_id,product_id,quantity,cost_to_customer_per_qty,price,running_total_purchases
0,9,2019-04-03,8,8,2.00,18.00,36.0000,36.0000
1,9,2019-04-03,8,7,1.00,18.00,18.0000,54.0000
2,9,2019-04-03,8,5,1.00,6.50,6.5000,60.5000
3,9,2019-04-03,8,7,2.00,18.00,36.0000,96.5000
4,6,2019-04-03,8,5,1.00,6.50,6.5000,103.0000
...,...,...,...,...,...,...,...,...
4216,10,2020-10-10,8,5,3.00,6.50,19.5000,69171.1367
4217,7,2020-10-10,8,8,1.00,18.00,18.0000,69189.1367
4218,2,2020-10-10,8,5,1.00,6.50,6.5000,69195.6367
4219,5,2020-10-10,7,4,4.00,3.50,14.0000,69209.6367
4220,11,2020-10-10,7,4,5.00,3.50,17.5000,69227.1367

In [315]:
# Running calculation for every row since just using order by without partition by
query27='''
SELECT customer_id,
      market_date,
      vendor_id,
      product_id,
      quantity,cost_to_customer_per_qty,
      quantity * cost_to_customer_per_qty AS price,
      SUM(quantity * cost_to_customer_per_qty) OVER (ORDER BY market_date,
   customer_id) AS running_total_purchases
  FROM farmers_market.customer_purchases
  '''
%sql $query27

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

,customer_id,market_date,vendor_id,product_id,quantity,cost_to_customer_per_qty,price,running_total_purchases
0,3,2019-04-03,7,4,1.00,4.00,4.0000,4.0000
1,4,2019-04-03,7,4,1.00,4.00,4.0000,8.0000
2,5,2019-04-03,7,4,3.00,4.00,12.0000,38.0000
3,5,2019-04-03,8,8,1.00,18.00,18.0000,38.0000
4,6,2019-04-03,7,4,4.00,4.00,16.0000,60.5000
...,...,...,...,...,...,...,...,...
4216,13,2020-10-10,8,5,1.00,6.50,6.5000,69014.6367
4217,19,2020-10-10,8,5,5.00,6.50,32.5000,69047.1367
4218,23,2020-10-10,8,8,5.00,18.00,90.0000,69173.1367
4219,23,2020-10-10,8,8,2.00,18.00,36.0000,69173.1367
4220,26,2020-10-10,8,7,3.00,18.00,54.0000,69227.1367

In [318]:
query28='''
select market_date, vendor_id, booth_number
from farmers_market.vendor_booth_assignments

'''
%sql $query28

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
921 rows affected.

    market_date  vendor_id  booth_number
0    2019-04-03          1             2
1    2019-04-03          3             1
2    2019-04-03          4             7
3    2019-04-03          7            11
4    2019-04-03          8             6
..          ...        ...           ...
916  2020-10-10          1             2
917  2020-10-10          3             1
918  2020-10-10          7            11
919  2020-10-10          8             7
920  2020-10-10          9             8

[921 rows x 3 columns]

In [330]:
query28='''
select market_date,  booth_number, 
lag(booth_number,1) over (partition by vendor_id
order by booth_number,market_date) as previous_booth_number,
vendor_id
from farmers_market.vendor_booth_assignments
order by market_date , vendor_id  , booth_number
'''
%sql $query28

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
921 rows affected.

    market_date  booth_number  previous_booth_number  vendor_id
0    2019-04-03             2                    NaN          1
1    2019-04-03             1                    NaN          3
2    2019-04-03             7                    2.0          4
3    2019-04-03            11                    NaN          7
4    2019-04-03             6                    NaN          8
..          ...           ...                    ...        ...
916  2020-10-10             2                    2.0          1
917  2020-10-10             1                    1.0          3
918  2020-10-10            11                   11.0          7
919  2020-10-10             7                    6.0          8
920  2020-10-10             8                    8.0          9

[921 rows x 4 columns]

In [335]:
query28='''
select market_date, vendor_id  , previous_booth_number from (
select market_date,  booth_number, 
lag(booth_number,1) over (partition by vendor_id
order by booth_number,market_date) as previous_booth_number,
vendor_id
from farmers_market.vendor_booth_assignments
order by market_date , vendor_id  , booth_number

) as x
where x.booth_number is not null and x.previous_booth_number is not null

'''
%sql $query28

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
915 rows affected.

    market_date  vendor_id  previous_booth_number
0    2019-04-03          4                      2
1    2019-04-06          1                      2
2    2019-04-06          3                      1
3    2019-04-06          4                      7
4    2019-04-06          7                     11
..          ...        ...                    ...
910  2020-10-10          1                      2
911  2020-10-10          3                      1
912  2020-10-10          7                     11
913  2020-10-10          8                      6
914  2020-10-10          9                      8

[915 rows x 3 columns]

## Rule of Thumb
#### he database processes it in logical phases like this:

FROM / JOIN → get the source rows.

WHERE → filter out unwanted rows.

GROUP BY → group rows (if needed).

HAVING → filter groups.

Window functions (OVER) →

Run after grouping/aggregation (if any).

Work on the already-prepared row set, but before the final ORDER BY.

SELECT list → output columns (including window function results).

ORDER BY → sort the final results.

LIMIT → keep only certain rows.

## EDA

In [336]:
query27=''' select * from farmers_market.product
limit 10
'''
%sql $query27

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
10 rows affected.

,product_id,product_name,product_size,product_category_id,product_qty_type
0,1,Habanero Peppers - Organic,medium,1,lbs
1,2,Jalapeno Peppers - Organic,small,1,lbs
2,3,Poblano Peppers - Organic,large,1,unit
3,4,Banana Peppers - Jar,8 oz,3,unit
4,5,Whole Wheat Bread,1.5 lbs,3,unit
5,6,Cut Zinnias Bouquet,medium,5,unit
6,7,Apple Pie,"10""",3,unit
7,8,Cherry Pie,"10""",3,unit
8,9,Sweet Potatoes,medium,1,lbs
9,10,Eggs,1 dozen,6,unit

In [342]:
# let us check product id is unique or not
query27=''' select product_id, count(*) from farmers_market.product
group by product_id
having count(*)>1
limit 10
'''
%sql $query27

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
0 rows affected.

Empty DataFrame
Columns: []
Index: []

In [344]:
%sql select * from farmers_market.product

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
23 rows affected.

,product_id,product_name,product_size,product_category_id,product_qty_type
0,1,Habanero Peppers - Organic,medium,1,lbs
1,2,Jalapeno Peppers - Organic,small,1,lbs
2,3,Poblano Peppers - Organic,large,1,unit
3,4,Banana Peppers - Jar,8 oz,3,unit
4,5,Whole Wheat Bread,1.5 lbs,3,unit
5,6,Cut Zinnias Bouquet,medium,5,unit
6,7,Apple Pie,"10""",3,unit
7,8,Cherry Pie,"10""",3,unit
8,9,Sweet Potatoes,medium,1,lbs
9,10,Eggs,1 dozen,6,unit
10,11,Pork Chops,1 lb,6,lbs
11,12,Baby Salad Lettuce Mix - Bag,1/2 lb,1,unit
12,13,Baby Salad Lettuce Mix,1 lb,1,lbs
13,14,Red Potatoes,None,1,None
14,15,Red Potatoes - Small,,1,None
15,16,Sweet Corn,Ear,1,unit
16,17,Carrots,sold by weight,1,lbs
17,18,Carrots - Organic,bunch,1,unit
18,19,Farmer's Market Resuable Shopping Bag,medium,7,unit
19,20,Homemade Beeswax Candles,"6""""",7,unit
20,21,Organic Cherry Tomatoes,pint,1,unit
21,22,Roma Tomatoes,medium,1,lbs
22,23,Maple Syrup - Jar,8 oz,2,unit

In [345]:
query27=''' select product_category_id, product_category_name, 
count(*) as count_of_products 
from farmers_market.product
group by product_category_id, product_category_name
'''
%sql $query27

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.OperationalError) (1054, "Unknown column 'product_category_name' in 'field list'")
[SQL: select product_category_id, product_category_name, count(*) as count_of_products from farmers_market.product group by product_category_id, product_category_name]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [349]:
%sql select  product_qty_type, count(*) from farmers_market.product group by product_qty_type

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
3 rows affected.

  product_qty_type  count(*)
0              lbs         7
1             unit        14
2             None         2

In [352]:
%sql select  * from farmers_market.vendor_inventory limit 10

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1146, "Table 'farmers_market.vendor_inventory' doesn't exist")
[SQL: select * from farmers_market.vendor_inventory limit 10]
(Background on this error at: https://sqlalche.me/e/14/f405)

### MySQL processes GROUP BY before assigning the column aliases from the SELECT list.

This means that at the point where GROUP BY is being executed, year and month don’t exist yet — only the raw expressions do.

In [359]:
query27='''
SELECT
EXTRACT(YEAR FROM market_date) AS market_year,
EXTRACT(MONTH FROM market_date) AS market_month,
count(market_rain_flag)
FROM farmers_market.market_date_info
GROUP BY EXTRACT(YEAR FROM market_date) , EXTRACT(MONTH FROM market_date)
ORDER BY EXTRACT(YEAR FROM market_date), EXTRACT(MONTH FROM market_date)
'''
%sql $query27
# in the above code we can use reuslt of expression like EXTRACT directly with group by
# without using alias because

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
18 rows affected.

    market_year  market_month  count(market_rain_flag)
0          2019             3                        8
1          2019             4                        8
2          2019             5                        9
3          2019             6                        9
4          2019             7                        9
5          2019             8                        9
6          2019             9                        8
7          2019            10                        9
8          2019            11                        9
9          2019            12                        8
10         2020             3                        8
11         2020             4                        9
12         2020             5                        9
13         2020             6                        8
14         2020             7                        9
15         2020             8                        9
16         2020             9                        9
17         2020            10                        3

In [354]:
%sql select * from market_date_info

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
150 rows affected.

,market_date,market_day,market_week,market_year,market_start_time,market_end_time,special_notes,market_season,market_min_temp,market_max_temp,market_rain_flag,market_snow_flag
0,2019-03-02,Saturday,9,2019,8:00 AM,2:00 PM,None,Spring,34,42,0,0
1,2019-03-09,Saturday,10,2019,9:00 AM,2:00 PM,None,Spring,28,32,0,1
2,2019-03-13,Wednesday,11,2019,4:00 PM,7:00 PM,None,Spring,52,60,0,0
3,2019-03-16,Saturday,11,2019,8:00 AM,2:00 PM,None,Spring,33,45,0,0
4,2019-03-20,Wednesday,12,2019,4:00 PM,7:00 PM,None,Spring,43,51,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
145,2020-09-26,Saturday,39,2020,8:00 AM,2:00 PM,None,Summer/Early Fall,None,None,0,0
146,2020-09-30,Wednesday,40,2020,4:00 PM,7:00 PM,None,Summer/Early Fall,None,None,1,0
147,2020-10-03,Saturday,40,2020,8:00 AM,2:00 PM,None,Summer/Early Fall,None,None,0,0
148,2020-10-07,Wednesday,41,2020,4:00 PM,7:00 PM,None,Summer/Early Fall,None,None,0,0
149,2020-10-10,Saturday,41,2020,8:00 AM,2:00 PM,None,Summer/Early Fall,None,None,0,0

In [362]:
%sql select booth_number, count(*) as hello from farmers_market.vendor_booth_assignments group by booth_number

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
7 rows affected.

   booth_number  hello
0             1    142
1             2    142
2             6     88
3             7    142
4             8    142
5            10     53
6            11    212

In [363]:
%sql select * from farmers_market.product

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
23 rows affected.

,product_id,product_name,product_size,product_category_id,product_qty_type
0,1,Habanero Peppers - Organic,medium,1,lbs
1,2,Jalapeno Peppers - Organic,small,1,lbs
2,3,Poblano Peppers - Organic,large,1,unit
3,4,Banana Peppers - Jar,8 oz,3,unit
4,5,Whole Wheat Bread,1.5 lbs,3,unit
5,6,Cut Zinnias Bouquet,medium,5,unit
6,7,Apple Pie,"10""",3,unit
7,8,Cherry Pie,"10""",3,unit
8,9,Sweet Potatoes,medium,1,lbs
9,10,Eggs,1 dozen,6,unit
10,11,Pork Chops,1 lb,6,lbs
11,12,Baby Salad Lettuce Mix - Bag,1/2 lb,1,unit
12,13,Baby Salad Lettuce Mix,1 lb,1,lbs
13,14,Red Potatoes,None,1,None
14,15,Red Potatoes - Small,,1,None
15,16,Sweet Corn,Ear,1,unit
16,17,Carrots,sold by weight,1,lbs
17,18,Carrots - Organic,bunch,1,unit
18,19,Farmer's Market Resuable Shopping Bag,medium,7,unit
19,20,Homemade Beeswax Candles,"6""""",7,unit
20,21,Organic Cherry Tomatoes,pint,1,unit
21,22,Roma Tomatoes,medium,1,lbs
22,23,Maple Syrup - Jar,8 oz,2,unit

In [365]:
%sql $query27

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
18 rows affected.

    market_year  market_month  count(market_rain_flag)
0          2019             3                        8
1          2019             4                        8
2          2019             5                        9
3          2019             6                        9
4          2019             7                        9
5          2019             8                        9
6          2019             9                        8
7          2019            10                        9
8          2019            11                        9
9          2019            12                        8
10         2020             3                        8
11         2020             4                        9
12         2020             5                        9
13         2020             6                        8
14         2020             7                        9
15         2020             8                        9
16         2020             9                        9
17         2020            10                        3

In [366]:
%sql $query26

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

,product_id,vendor_id,market_date,customer_id,quantity,cost_to_customer_per_qty,transaction_time
0,8,8,2019-04-03,9,2.00,18.00,0 days 16:17:00
1,7,8,2019-04-03,9,1.00,18.00,0 days 16:20:00
2,5,8,2019-04-03,9,1.00,6.50,0 days 16:40:00
3,7,8,2019-04-03,9,2.00,18.00,0 days 17:08:00
4,5,8,2019-04-03,6,1.00,6.50,0 days 17:22:00
...,...,...,...,...,...,...,...
4216,5,8,2020-10-10,10,3.00,6.50,0 days 13:41:00
4217,8,8,2020-10-10,7,1.00,18.00,0 days 13:44:00
4218,5,8,2020-10-10,2,1.00,6.50,0 days 13:50:00
4219,4,7,2020-10-10,5,4.00,3.50,0 days 13:50:00
4220,4,7,2020-10-10,11,5.00,3.50,0 days 13:50:00

In [367]:
%sql select * from farmers_market.customer_purchases

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

,product_id,vendor_id,market_date,customer_id,quantity,cost_to_customer_per_qty,transaction_time
0,1,7,2019-07-03,14,0.99,6.99,0 days 17:32:00
1,1,7,2019-07-03,14,2.18,6.99,0 days 18:23:00
2,1,7,2019-07-03,15,1.53,6.99,0 days 18:41:00
3,1,7,2019-07-03,16,2.02,6.99,0 days 18:18:00
4,1,7,2019-07-03,22,0.66,6.99,0 days 17:34:00
...,...,...,...,...,...,...,...
4216,16,4,2020-09-30,4,2.00,0.50,0 days 18:48:00
4217,16,4,2020-09-30,11,1.00,0.50,0 days 16:30:00
4218,16,4,2020-09-30,16,5.00,0.50,0 days 18:25:00
4219,16,4,2020-09-30,18,6.00,0.50,0 days 18:28:00
4220,16,4,2020-09-30,18,4.00,0.50,0 days 18:50:00

In [371]:
query27='''
select  time( str_to_time()) as transcation_time from farmers_market.customer_purchases
'''
%sql $query27

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.OperationalError) (1582, "Incorrect parameter count in the call to native function 'str_to_date'")
[SQL: select time( str_to_date(market_date)) as transcation_time from farmers_market.customer_purchases]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [400]:
query28='''
select * from
(SELECT market_date,
 vendor_id,
 product_id,
 SUM(quantity) quantity_sold,
 SUM(quantity * cost_to_customer_per_qty) total_sales
FROM farmers_market.customer_purchases
WHERE vendor_id = 7 and product_id = 4
GROUP BY market_date, vendor_id, product_id
ORDER BY market_date, vendor_id, product_id)   x
where x.total_sales = (select min(total_sales)  from x)

'''
%sql $query28

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1146, "Table 'farmers_market.x' doesn't exist")
[SQL: select * from (SELECT market_date, vendor_id, product_id, SUM(quantity) quantity_sold, SUM(quantity * cost_to_customer_per_qty) total_sales FROM farmers_market.customer_purchases WHERE vendor_id = 7 and product_id = 4 GROUP BY market_date, vendor_id, product_id ORDER BY market_date, vendor_id, product_id) as x where x.total_sales = (select min(total_sales) from x)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [411]:
query28='''
select * from
(SELECT market_date,
 vendor_id,
 product_id,
 SUM(quantity) quantity_sold,
 SUM(quantity * cost_to_customer_per_qty) total_sales
FROM farmers_market.customer_purchases
WHERE vendor_id = 7 and product_id = 4
GROUP BY market_date, vendor_id, product_id
ORDER BY market_date, vendor_id, product_id)  x
where x.total_sales=(SELECT MIN(total_sales) FROM x)
'''
%sql $query28

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1146, "Table 'farmers_market.x' doesn't exist")
[SQL: select * from (SELECT market_date, vendor_id, product_id, SUM(quantity) quantity_sold, SUM(quantity * cost_to_customer_per_qty) total_sales FROM farmers_market.customer_purchases WHERE vendor_id = 7 and product_id = 4 GROUP BY market_date, vendor_id, product_id ORDER BY market_date, vendor_id, product_id) x where x.total_sales=(SELECT MIN(total_sales) FROM x)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [437]:
query28='''

with x as (SELECT market_date,
 vendor_id,
 product_id,
 SUM(quantity) quantity_sold,
 SUM(quantity * cost_to_customer_per_qty) total_sales
FROM farmers_market.customer_purchases
WHERE vendor_id = 7 and product_id = 4
GROUP BY market_date, vendor_id, product_id
ORDER BY market_date, vendor_id, product_id)  

select * from x where total_sales   in  ( (select  min(total_sales) from x) union (select  max(total_sales) from x) )
'''
%sql $query28

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
3 rows affected.

  market_date  vendor_id  product_id quantity_sold total_sales
0  2019-10-23          7           4         40.00    160.0000
1  2019-11-02          7           4         40.00    160.0000
2  2020-07-22          7           4          1.00      4.0000

In [438]:
query28='''

with x as (SELECT market_date,
 vendor_id,
 product_id,
 SUM(quantity) quantity_sold,
 SUM(quantity * cost_to_customer_per_qty) total_sales
FROM farmers_market.customer_purchases
WHERE vendor_id = 7 and product_id = 4
GROUP BY market_date, vendor_id, product_id
ORDER BY market_date, vendor_id, product_id)  

select * from x where total_sales =(select  min(total_sales) from x)  
or total_sales= (select  max(total_sales) from x) 
'''
%sql $query28

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
3 rows affected.

  market_date  vendor_id  product_id quantity_sold total_sales
0  2019-10-23          7           4         40.00    160.0000
1  2019-11-02          7           4         40.00    160.0000
2  2020-07-22          7           4          1.00      4.0000

In [439]:
%sql select * from farmers_market.customer_purchases

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

,product_id,vendor_id,market_date,customer_id,quantity,cost_to_customer_per_qty,transaction_time
0,1,7,2019-07-03,14,0.99,6.99,0 days 17:32:00
1,1,7,2019-07-03,14,2.18,6.99,0 days 18:23:00
2,1,7,2019-07-03,15,1.53,6.99,0 days 18:41:00
3,1,7,2019-07-03,16,2.02,6.99,0 days 18:18:00
4,1,7,2019-07-03,22,0.66,6.99,0 days 17:34:00
...,...,...,...,...,...,...,...
4216,16,4,2020-09-30,4,2.00,0.50,0 days 18:48:00
4217,16,4,2020-09-30,11,1.00,0.50,0 days 16:30:00
4218,16,4,2020-09-30,16,5.00,0.50,0 days 18:25:00
4219,16,4,2020-09-30,18,6.00,0.50,0 days 18:28:00
4220,16,4,2020-09-30,18,4.00,0.50,0 days 18:50:00

In [441]:
%sql select * from farmers_market.vendor_booth_inventory

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1146, "Table 'farmers_market.vendor_booth_inventory' doesn't exist")
[SQL: select * from farmers_market.vendor_booth_inventory]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [444]:
%sql show tables

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
9 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments
8    vendor_booth_inventory

In [443]:
%load_ext sql
%sql mysql+pymysql://root:coolNeon%4023@localhost:3306/farmers_market

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [445]:
%sql select * from vendor_booth_inventory

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
797 rows affected.

    market_date  quantity  vendor_id  product_id  original_price
0    2019-07-03      7.38          7           1            6.99
1    2019-07-06     10.96          7           1            6.99
2    2019-07-10     13.08          7           1            6.99
3    2019-07-13     10.22          7           1            6.99
4    2019-07-17     10.59          7           1            6.99
..          ...       ...        ...         ...             ...
792  2020-09-16    140.00          4          16            0.50
793  2020-09-19    140.00          4          16            0.50
794  2020-09-23    100.00          4          16            0.50
795  2020-09-26    120.00          4          16            0.50
796  2020-09-30    140.00          4          16            0.50

[797 rows x 5 columns]

In [11]:
query101=''' select * from (select column_name from information_schema.columns
where table_name='vendor_booth_inventory'
and table_schema='farmers_market'
) as table1
union 
select * from (select column_name from information_schema.columns
where table_name='customer_purchases'
and table_schema='farmers_market'
) as table2 
'''

vendor_inventory=%sql $query101
vendor_inventory

 * mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

[('market_date',),
 ('quantity',),
 ('vendor_id',),
 ('product_id',),
 ('original_price',),
 ('customer_id',),
 ('cost_to_customer_per_qty',),
 ('transaction_time',)]

In [462]:
%sql shoe

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
9 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments
8    vendor_booth_inventory

In [40]:
# vendor_inventory,customer_purchases, vendor(vendor_name), product(product_name)
query104='''
select * from farmers_market.vendor_booth_inventory as vi 
left join 
        (
        select  market_date,vendor_id,product_id,
            sum(quantity) as quantity_sold, 
            sum(quantity * cost_to_customer_per_qty) as total_sales
            from farmers_market.customer_purchases
            group by market_date, vendor_id, product_id
        ) as cp 
        on vi.market_date = cp.market_date 
            and vi.vendor_id = cp.vendor_id and 
            vi.product_id = cp.product_id
order by vi.market_date, vi.vendor_id, vi.product_id
limit 10
'''
%sql $query104

 * mysql+pymysql://root:***@localhost:3306/farmers_market
10 rows affected.

[('2019-04-03', 40.0, 7, 4, 4.0, datetime.date(2019, 4, 3), 7, 4, Decimal('19.00'), Decimal('76.0000')),
 ('2019-04-03', 16.0, 8, 5, 6.5, datetime.date(2019, 4, 3), 8, 5, Decimal('6.00'), Decimal('39.0000')),
 ('2019-04-03', 8.0, 8, 7, 18.0, datetime.date(2019, 4, 3), 8, 7, Decimal('9.00'), Decimal('162.0000')),
 ('2019-04-03', 10.0, 8, 8, 18.0, datetime.date(2019, 4, 3), 8, 8, Decimal('11.00'), Decimal('198.0000')),
 ('2019-04-06', 40.0, 7, 4, 4.0, datetime.date(2019, 4, 6), 7, 4, Decimal('28.00'), Decimal('112.0000')),
 ('2019-04-06', 23.0, 8, 5, 6.5, datetime.date(2019, 4, 6), 8, 5, Decimal('23.00'), Decimal('149.5000')),
 ('2019-04-06', 8.0, 8, 7, 18.0, datetime.date(2019, 4, 6), 8, 7, Decimal('7.00'), Decimal('126.0000')),
 ('2019-04-06', 8.0, 8, 8, 18.0, datetime.date(2019, 4, 6), 8, 8, Decimal('9.00'), Decimal('162.0000')),
 ('2019-04-10', 30.0, 7, 4, 4.0, datetime.date(2019, 4, 10), 7, 4, Decimal('23.00'), Decimal('92.0000')),
 ('2019-04-10', 23.0, 8, 5, 6.5, datetime.date(2019, 4, 10), 8, 5, Decimal('22.00'), Decimal('143.0000'))]

In [ ]:
# Next task is to put vendor_name and product_name from the table make it like fig 9.17